Учет_документов_20.ДокументыИТорги/src/Documents/РасшДТ_ОтправкаПочты/РасшДТ_ОтправкаПочты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасшДТ_ОтправкаПочты</name>
  <registerRecords>InformationRegister.РасшДТ_ДоставкаДокументовКурьером</registerRecords>
  <attributes>
    <name>НеИзрасходованныеСредстваИзПредыдущегоОтчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолученоНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолученияСредств</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПотраченоНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсталосьПотратитьНаПочтовыеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПисьмаОтправил</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнформацияООтправленныхДокументах</name>
    <attributes>
      <name>ДатаОтправкиПисьма</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПолучательДокументов</name>
      <type>
        <types>CatalogRef.РасшДТ_Клиенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОписьСодержимогоКонверта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерДляОтслеживания</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учет_документов_20.ДокументыИТорги/src/Documents/РасшДТ_ОтправкаПочты/ManagerModule.bsl
// Процедура заполняет табличный документ для печати.
//
// Параметры:
//	ТабДок - ТабличныйДокумент - табличный документ для заполнения и печати.
//	Ссылка - Произвольный - содержит ссылку на объект, для которого вызвана команда печати.
Процедура ОтчетОРасходеСредств(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ОтчетОРасходеСредств)
	Макет = Документы.РасшДТ_ОтправкаПочты.ПолучитьМакет("ОтчетОРасходеСредств");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОтправкаПочты.Номер,
		|	ОтправкаПочты.Дата,
		|	ОтправкаПочты.НеИзрасходованныеСредстваИзПредыдущегоОтчета,
		|	ОтправкаПочты.ПолученоНаПочтовыеРасходы,
		|	ОтправкаПочты.ДатаПолученияСредств,
		|	ОтправкаПочты.ПотраченоНаПочтовыеРасходы,
		|	ОтправкаПочты.ОсталосьПотратитьНаПочтовыеРасходы,
		|	ОтправкаПочты.ПисьмаОтправил,
		|	ОтправкаПочты.ИнформацияООтправленныхДокументах.(
		|		НомерСтроки,
		|		ДатаОтправкиПисьма,
		|		ПолучательДокументов,
		|		ОписьСодержимогоКонверта,
		|		Сумма)
		|ИЗ
		|	Документ.РасшДТ_ОтправкаПочты КАК ОтправкаПочты
		|ГДЕ
		|	ОтправкаПочты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИнформацияООтправленныхДокументахШапка = Макет.ПолучитьОбласть("ИнформацияООтправленныхДокументахШапка");
	ОбластьИнформацияООтправленныхДокументах = Макет.ПолучитьОбласть("ИнформацияООтправленныхДокументах");
	Подвал = Макет.ПолучитьОбласть("Подвал");
	
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());	
		ТабДок.Вывести(ОбластьИнформацияООтправленныхДокументахШапка);
		ВыборкаИнформацияООтправленныхДокументах = Выборка.ИнформацияООтправленныхДокументах.Выбрать();
		Пока ВыборкаИнформацияООтправленныхДокументах.Следующий() Цикл
			ОбластьИнформацияООтправленныхДокументах.Параметры.Заполнить(ВыборкаИнформацияООтправленныхДокументах);
			ТабДок.Вывести(ОбластьИнформацияООтправленныхДокументах, ВыборкаИнформацияООтправленныхДокументах.Уровень());
		КонецЦикла;
		
		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);	
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
